Autodesk.Revit.DB.TextNote.SetFormattedText(Autodesk.Revit.DB.FormattedText)
Sets the text and associated formatting of the text of in this text note with
a given FormattedText object.
formattedText:
The FormattedText object containing the text and associated formatting of the text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.TextNote.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,System.Double,System.String,Autodesk.Revit.DB.TextNoteOptions)
Creates a new line-wrapping text note element of the given width and properties.
Remarks:
As a view-specific element the text note will be visible only in the specified view.
The new text note will be created using the give text type, which defines the style.
The currently default style can be obtained from the Document.GetDefaultElementTypeId method.
document:
A valid Revit document that is currently modifiable (i.e. with an open transaction).
viewId:
Id of the graphic view in which the note is to be created.
position:
A model position of the new note.
Note that the position's relation to the text's bounding box depends on the requested text alignment
(set via the Options argument). It will be the box' top-left corner for a left-aligned text,
the top-right corner for a right-aligned text, and middle-top point if the text is to be centered.
width:
Width [ft] of the text in paper space (i.e. as it is measured when printed.)
If a line of text is longer than the given specified Width, the text will be automatically wrapped.
If a a zero Width is supplied then this method will create an unwrapped text note element.
text:
Text to populate the text note with.
options:
Options to control behavior and appearance of the text note.
Returns:
The newly created text note.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document is a family that cannot contain text notes.
-or-
The viewId does not represent a valid graphic view element in the given document.
-or-
The options structure does not contain a valid text type to use for a new text note in the given document.
-or-
A valid point must not be father then 10 miles (approx. 16 km) from the origin.
-or-
The given width is not valid. A valid value must be within the range
returned by static methods GetMinimumWidthLimit and GetMaximumWidthLimit.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.TextNote.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,System.Double,System.String,Autodesk.Revit.DB.ElementId)
Creates a new line-wrapping text note element of the given width and properties.
Remarks:
As a view-specific element the text note will be visible only in the specified view.
The new text note will be created using the given text type, which defines the style.
The currently default style can be obtained from the Document.GetDefaultElementTypeId method.
document:
A valid Revit document that is currently modifiable (i.e. with an open transaction).
viewId:
Id of the graphic view in which the note is to be created.
position:
A model position of the new note.
For a left-aligned text (default), the origin is set at the top-left corner of the note's bounding box.
width:
Width [ft] of the text in paper space (i.e. as it is measured when printed.)
If a line of text is longer than the specified Width, the text will be automatically wrapped.
If a a zero Width is supplied then this method will create an unwrapped text note element.
text:
Text to populate the text note with.
typeId:
Id of the text type to use for the new text note.
The text type allows its font name parameter to be set to a font unavailable on the current system.
However, any text note created with or set to this font type will be displayed in a default substituted font (e.g. Arial)
and the UI will show a blank value in the text type font name parameter.
Once the document is opened on a system which has the font set on the text type,
the text note will display with that font and the UI will show that font in the text type font name parameter.
Returns:
The newly created text note.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document is a family that cannot contain text notes.
-or-
The viewId does not represent a valid graphic view element in the given document.
-or-
The typeId does not represent a valid text type in the given document.
-or-
A valid point must not be father then 10 miles (approx. 16 km) from the origin.
-or-
The given width is not valid. A valid value must be within the range
returned by the static methods GetMinimumAllowedWidth and GetMaximumAllowedWidth.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.TextNote.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,System.String,Autodesk.Revit.DB.TextNoteOptions)
Creates a new unwrapped text note element with the given properties.
Remarks:
The new text note will consist of a single line of text unless there
are line-break characters (CR) in the given string. Once the text note is
created its width gets adjusted to fit the longest (or the single one) line of text.
As a view-specific element the text note will be visible only in the specified view.
The new text note will be created using the given text type, which defines the style.
The currently default style can be obtained from the Document.GetDefaultElementTypeId method.
document:
A valid Revit document that is currently modifiable (i.e. with an open transaction).
viewId:
Id of the graphic view in which the note is to be created.
position:
A model position of the new note.
Note that the position's relation to the text's bounding box depends on the requested text alignment
(set via the Options argument). It will be the box' top-left corner for a left-aligned text,
the top-right corner for a right-aligned text, and middle-top point if the text is to be centered.
text:
Text to populate the text note with.
options:
Options to control behavior and appearance of the text note.
Returns:
The newly created text note.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document is a family that cannot contain text notes.
-or-
The viewId does not represent a valid graphic view element in the given document.
-or-
The options structure does not contain a valid text type to use for a new text note in the given document.
-or-
A valid point must not be father then 10 miles (approx. 16 km) from the origin.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.TextNote.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,System.String,Autodesk.Revit.DB.ElementId)
Creates a new unwrapped TextNote element with the given properties.
Remarks:
The new TextNote will consist of a single line of text unless there
are carriage return ('\r') or vertical tab ('\v') characters in the given string. Once the text note is
created its width gets adjusted to fit the longest (or the single one) line of text.
As a view-specific element the TextNote will be visible only in the specified view.
The new TextNote will be created using the given text type, which defines the style.
The currently default style can be obtained from the Document.GetDefaultElementTypeId method.
document:
A valid Revit document that is currently modifiable (i.e. with an open transaction).
viewId:
Id of the graphic view in which the note is to be created.
position:
A model position of the new note.
For a left-aligned text (default), the origin is set at the top-left corner of the note's bounding box.
text:
Text to populate the text note with.
typeId:
Id of the text type to use for the new text note.
Returns:
The newly created text note.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document is a family that cannot contain text notes.
-or-
The viewId does not represent a valid graphic view element in the given document.
-or-
The typeId does not represent a valid text type in the given document.
-or-
A valid point must not be father then 10 miles (approx. 16 km) from the origin.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016